{"class_name": "Model", "keras_version": "2.1.2", "config": {"output_layers": [["dense_1", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_2", "batch_input_shape": [null, 17]}}, {"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 246, 39]}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_1", "class_name": "Embedding", "config": {"activity_regularizer": null, "dtype": "float32", "name": "embedding_1", "batch_input_shape": [null, 17], "embeddings_constraint": null, "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "input_length": 17, "trainable": false, "output_dim": 200, "embeddings_regularizer": null, "input_dim": 1555}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "bidirectional_1", "class_name": "Bidirectional", "config": {"trainable": true, "name": "bidirectional_1", "layer": {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dropout": 0.3, "kernel_constraint": null, "recurrent_dropout": 0.3, "name": "gru_1", "activity_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "stateful": false, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "implementation": 1, "units": 128, "trainable": true}}, "merge_mode": "concat"}}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "bidirectional_3", "class_name": "Bidirectional", "config": {"trainable": true, "name": "bidirectional_3", "layer": {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dropout": 0.3, "kernel_constraint": null, "recurrent_dropout": 0.3, "name": "gru_3", "activity_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "stateful": false, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "implementation": 1, "units": 128, "trainable": true}}, "merge_mode": "concat"}}, {"inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "name": "bidirectional_2", "class_name": "Bidirectional", "config": {"trainable": true, "name": "bidirectional_2", "layer": {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dropout": 0.3, "kernel_constraint": null, "recurrent_dropout": 0.3, "name": "gru_2", "activity_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "stateful": false, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "implementation": 1, "units": 128, "trainable": true}}, "merge_mode": "concat"}}, {"inbound_nodes": [[["bidirectional_3", 0, 0, {}]]], "name": "bidirectional_4", "class_name": "Bidirectional", "config": {"trainable": true, "name": "bidirectional_4", "layer": {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dropout": 0.3, "kernel_constraint": null, "recurrent_dropout": 0.3, "name": "gru_4", "activity_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "stateful": false, "bias_constraint": null, "go_backwards": false, "recurrent_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "implementation": 1, "units": 128, "trainable": true}}, "merge_mode": "concat"}}, {"inbound_nodes": [[["bidirectional_2", 0, 0, {}], ["bidirectional_4", 0, 0, {}]]], "name": "dot_1", "class_name": "Dot", "config": {"trainable": true, "normalize": false, "name": "dot_1", "axes": 1}}, {"inbound_nodes": [[["dot_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "sigmoid", "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 1, "trainable": true, "bias_constraint": null}}]}, "backend": "tensorflow"}