{"class_name": "Model", "config": {"output_layers": [["add_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 1], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 1], "name": "input_2", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "embedding_1", "config": {"output_dim": 16, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "dtype": "float32", "input_length": 1, "batch_input_shape": [null, 1], "activity_regularizer": null, "name": "embedding_1", "trainable": true, "embeddings_constraint": null, "embeddings_regularizer": null, "input_dim": 6041, "mask_zero": false}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Embedding", "name": "embedding_2", "config": {"output_dim": 16, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "dtype": "float32", "input_length": 1, "batch_input_shape": [null, 1], "activity_regularizer": null, "name": "embedding_2", "trainable": true, "embeddings_constraint": null, "embeddings_regularizer": null, "input_dim": 3953, "mask_zero": false}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_1", "config": {"name": "reshape_1", "trainable": true, "target_shape": [16]}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_2", "config": {"name": "reshape_2", "trainable": true, "target_shape": [16]}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"class_name": "Embedding", "name": "embedding_3", "config": {"output_dim": 1, "embeddings_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "input_length": 1, "batch_input_shape": [null, 1], "activity_regularizer": null, "name": "embedding_3", "trainable": true, "embeddings_constraint": null, "embeddings_regularizer": null, "input_dim": 6041, "mask_zero": false}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Embedding", "name": "embedding_4", "config": {"output_dim": 1, "embeddings_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "input_length": 1, "batch_input_shape": [null, 1], "activity_regularizer": null, "name": "embedding_4", "trainable": true, "embeddings_constraint": null, "embeddings_regularizer": null, "input_dim": 3953, "mask_zero": false}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Dot", "name": "dot_1", "config": {"axes": 1, "name": "dot_1", "trainable": true, "normalize": true}, "inbound_nodes": [[["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_3", "config": {"name": "reshape_3", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_4", "config": {"name": "reshape_4", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["dot_1", 0, 0, {}], ["reshape_3", 0, 0, {}], ["reshape_4", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "keras_version": "2.1.2", "backend": "tensorflow"}